app/controllers/api/v1/auth/sessions_controller.rb

INSERT INTO "users" ("email", "password_digest", "name", "avatar_url", "timezone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
        def signup
          # First user becomes owner, subsequent users are members
          is_first_user = User.count.zero?

          user = User.new(signup_params)
          user.role = is_first_user ? "owner" : "member"

          if user.save

SELECT "users".* FROM "users" WHERE (LOWER(email) = $1) ORDER BY "users"."id" ASC LIMIT $2  [[nil, "john@example.com"], ["LIMIT", 1]]
---
        def login
          user = User.find_by_email(params[:email])